In [1]:
import pandas as pd
from pathlib import Path
import requests
from datetime import datetime

In [2]:
#Store the filepath for each csv file into a variable

state_path = "/Users/savirahiman/Desktop/ClassWork/Data Engineer Project/census_data/MapData.csv"
population_path = "/Users/savirahiman/Desktop/ClassWork/Data Engineer Project/census_data/SUB-IP-EST2023-POP.csv"

In [3]:
#Read the csv files using pandas

state = pd.read_csv(state_path)
population = pd.read_csv(population_path)

In [4]:
#Store each csv file in a DataFrame

state_df = pd.DataFrame(state)
pop_df = pd.DataFrame(population)

In [6]:
#Removed some of the unnecessary columns by specifying the columns to keep.

state_df = state_df.loc[:, ['Geography', 'Estimate (Consumer expenditures per household on Entertainment / Recreation)', 'Estimate (Percent working age (25 to 64 years))']]
pop_df = pop_df.loc[:, ['City', 'State', 'avg_population']]

state_df.rename(columns={
    'Geography': 'State',
    'Estimate (Consumer expenditures per household on Entertainment / Recreation)' : 'Entertainment/Recreation (per household)',
    'Estimate (Percent working age (25 to 64 years))' : '% of Working age(25-64)',
    
}, inplace=True)

In [7]:
state_df.head()

,State,Entertainment/Recreation (per household),% of Working age(25-64)
0,Alabama,3050.64,50.9
1,Arizona,3641.95,49.9
2,Arkansas,2973.20,50.1
3,California,4509.62,53.3
4,Colorado,4266.24,54.2

In [8]:
pop_df.head()

              City     State avg_population
0   Abbeville city   Alabama          2,362
1  Adamsville city   Alabama          4,262
2     Addison town   Alabama            666
3       Akron town   Alabama            226
4   Alabaster city   Alabama         33,779

In [12]:
pop_df['avg_population'] = pd.to_numeric(pop_df['avg_population'], errors='coerce')
pop_df.dropna(subset=['avg_population'], inplace=True)
idx = pop_df.groupby('State')['avg_population'].idxmax()
result = pop_df.loc[idx]
print(result)

                        City            State  avg_population
65           Carrollton town          Alabama           997.0
513              Hoonah city           Alaska           956.0
662           Patagonia town          Arizona           795.0
980              London city         Arkansas           995.0
1246           Bradbury city       California           902.0
1800             Haxtun town         Colorado           972.0
1980      Stonington borough      Connecticut           994.0
1997           Dagsboro town         Delaware           919.0
2047         Anna Maria city          Florida           993.0
2879             Sardis city          Georgia           996.0
3062           Hagerman city            Idaho           981.0
3586        Flanagan village         Illinois           999.0
5008            Wanatah town          Indiana           998.0
5879              Tabor city             Iowa           997.0
6514              Sedan city           Kansas           999.0
7003     Watterson Park city         Kentucky           999.0
7079       Choudrant village        Louisiana           999.0
7393   Chevy Chase View town         Maryland           997.0
7947          Onsted village         Michigan           998.0
8819            Scanlon city        Minnesota           994.0
9043            Edwards town      Mississippi           961.0
9749             Laurie city         Missouri           998.0
10303            Scobey city          Montana           994.0
10806            Tilden city         Nebraska           987.0
10858          Caliente city           Nevada           974.0
10900   Audubon Park borough       New Jersey           988.0
11225         Carrizozo town       New Mexico           971.0
11401        Castile village         New York           995.0
12092            Gaston town   North Carolina           991.0
12486             Beach city     North Dakota           979.0
13260    Lowellville village             Ohio           993.0
14128        North Enid town         Oklahoma           998.0
14521              Scio city           Oregon           964.0
15439    Sugar Notch borough     Pennsylvania           998.0
15855       West Pelzer town   South Carolina           985.0
16013           Ipswich city     South Dakota           942.0
16209          Bradford town        Tennessee           995.0
17610            Tenaha town            Texas           998.0
17964       Spring City city             Utah           979.0
18040      Woodstock village          Vermont           940.0
18097       Craigsville town         Virginia           907.0
18385         La Conner town       Washington           973.0
18689    New Cumberland city    West Virginia           998.0
18945      Elk Mound village        Wisconsin           988.0
19450         Moorcroft town          Wyoming           973.0

In [11]:
pop_df.head()

             City     State  avg_population
2    Addison town   Alabama           666.0
3      Akron town   Alabama           226.0
8    Allgood town   Alabama           547.0
9    Altoona town   Alabama           950.0
11  Anderson town   Alabama           254.0